[
  {
    "pre_desc": "Wilderness Flash Events: A group of Daemonheim spiders are roaming near the border north of Ube's beacon, north-east of Varrock. An extermination attempt will begin soon.",
    "special": false,
    "role_id": "1072266803687981148",
    "time_to_next_event": 1,
    "name": "Spider Swarm",
    "id": "spider swarm",
    "time_hh": 0,
    "time_mm": 0,
    "next_event": "unnatural outcrop",
    "desc": "Wilderness Flash Events: Spider Swarm has started north of Ube's beacon, north-east of Varrock!"
  },
  {
    "pre_desc": "Wilderness Flash Events: Demonic forces are prospecting an outcrop of ore near the south Wilderness Runite mine. They will start mining it soon.",
    "special": false,
    "role_id": "1072266859321249852",
    "time_to_next_event": 12,
    "name": "Unnatural Outcrop",
    "id": "unnatural outcrop",
    "time_hh": 1,
    "time_mm": 0,
    "next_event": "stryke the wyrm",
    "desc": "Wilderness Flash Events: Unnatural Outcrop has started near the south Wilderness Runite mine!"
  },
  {
    "pre_desc": "Wilderness Flash Events: ",
    "special": true,
    "role_id": "1204144166259396690",
    "time_to_next_event": 12,
    "name": "Stryke the Wyrm",
    "id": "stryke the wyrm",
    "time_hh": 2,
    "time_mm": 0,
    "next_event": "demon stragglers",
    "desc": "Wilderness Flash Events: Stryke the Wyrm has started near the south-east of the Lava Maze!"
  },
  {
    "pre_desc": "Wilderness Flash Events: Demonic forces are summoning a new legion of demons in the Wilderness Crater. Daemonheim forces will reward their removal.",
    "special": false,
    "role_id": "1072267016272097290",
    "time_to_next_event": 1,
    "name": "Demon Stragglers",
    "id": "demon stragglers",
    "time_hh": 3,
    "time_mm": 0,
    "next_event": "butterfly swarm",
    "desc": "Wilderness Flash Events: Demon Stragglers has started in the Wilderness Crater!"
  },
  {
    "pre_desc": "Wilderness Flash Events: Demonic forces are tracking a group of rare butterflies. They will intercept them near the obelisk south of the Wilderness lodestone soon.",
    "special": false,
    "role_id": "1072266904829435986",
    "time_to_next_event": 1,
    "name": "Butterfly Swarm",
    "id": "butterfly swarm",
    "time_hh": 4,
    "time_mm": 0,
    "next_event": "king black dragon rampage",
    "desc": "Wilderness Flash Events: Butterfly Swarm has started south of the Wilderness Lodestone!"
  },
  {
    "pre_desc": "Wilderness Flash Events: The King Black Dragon is infuriated by the disturbances in the Wilderness and is preparing to take out his rage on all combatants near Daemonheim.",
    "special": true,
    "role_id": "1072267060501037128",
    "time_to_next_event": 1,
    "name": "King Black Dragon Rampage",
    "id": "king black dragon rampage",
    "time_hh": 5,
    "time_mm": 0,
    "next_event": "forgotten soldiers",
    "desc": "Wilderness Flash Events: King Black Dragon Rampage has started on the plain north-west of Daemonheim!"
  },
  {
    "pre_desc": "Wilderness Flash Events: A raiding party of forgotten soldiers are advancing on the plain near the Daemonheim peninsula. Demonic forces want them killed.",
    "special": false,
    "role_id": "1072267105384267836",
    "time_to_next_event": 1,
    "name": "Forgotten Soldiers",
    "id": "forgotten soldiers",
    "time_hh": 6,
    "time_mm": 0,
    "next_event": "surprising seedlings",
    "desc": "Wilderness Flash Events: Forgotten Soldiers have arrived on the plain near the Daemonheim peninsula!"
  },
  {
    "pre_desc": "Wilderness Flash Events: Daemonheim forces are analysing some new plants at a pond south of the Wilderness lodestone. They will start harvesting them soon.",
    "special": false,
    "role_id": "1072267143061708843",
    "time_to_next_event": 1,
    "name": "Surprising Seedlings",
    "id": "surprising seedlings",
    "time_hh": 7,
    "time_mm": 0,
    "next_event": "hellhound pack",
    "desc": "Wilderness Flash Events: Surprising Seedlings has started at the pond south of the Wilderness lodestone!"
  },
  {
    "pre_desc": "Wilderness Flash Events: A pack of hellhounds is running to disrupt the Trollheim beacon, near the Dark Warriors' Fortress. Daemonheim forces need them killed.",
    "special": false,
    "role_id": "1072267204273389568",
    "time_to_next_event": 1,
    "name": "Hellhound Pack",
    "id": "hellhound pack",
    "time_hh": 8,
    "time_mm": 0,
    "next_event": "infernal star",
    "desc": "Wilderness Flash Events: Hellhound Pack has started near the Dark Warriors' Fortress!"
  },
  {
    "pre_desc": "Wilderness Flash Events: The Wilderness Volcano has launched a large rock high into the air above the wilderness. It will land soon near the Chaos Temple.",
    "special": true,
    "role_id": "1072267253120253982",
    "time_to_next_event": 1,
    "name": "Infernal Star",
    "id": "infernal star",
    "time_hh": 9,
    "time_mm": 0,
    "next_event": "lost souls",
    "desc": "Wilderness Flash Events: Infernal Star has started near the Chaos Temple!"
  },
  {
    "pre_desc": "Wilderness Flash Events: Daemonheim forces are getting ready to collect ectoplasm from the Forgotten Cemetery.",
    "special": false,
    "role_id": "1072267289526796390",
    "time_to_next_event": 1,
    "name": "Lost Souls",
    "id": "lost souls",
    "time_hh": 10,
    "time_mm": 0,
    "next_event": "ramokee incursion",
    "desc": "Wilderness Flash Events: Lost Souls has started in the Forgotten Cemetery!"
  },
  {
    "pre_desc": "Wilderness Flash Events: A ramokee squad has arrived to harass demons in the wilderness. They will rally soon by the shipwreck on the Daemonheim peninsula.",
    "special": false,
    "role_id": "1072267336138108959",
    "time_to_next_event": 1,
    "name": "Ramokee Incursion",
    "id": "ramokee incursion",
    "time_hh": 11,
    "time_mm": 0,
    "next_event": "displaced energy",
    "desc": "Wilderness Flash Events: Ramokee Incursion has started by the shipwreck on the Daemonheim peninsula!"
  },
  {
    "pre_desc": "Wilderness Flash Events: Daemonheim forces have detected a spike in divine energy west of the Dark Warriors' Fortress. They will begin collecting it soon.",
    "special": false,
    "role_id": "1072267405855822005",
    "time_to_next_event": 1,
    "name": "Displaced Energy",
    "id": "displaced energy",
    "time_hh": 12,
    "time_mm": 0,
    "next_event": "evil bloodwood tree",
    "desc": "Wilderness Flash Events: Displaced Energy has started at the pond west of the Dark Warriors' Fortress!"
  },
  {
    "pre_desc": "Wilderness Flash Events: Bloodshed in the Wilderness has encouraged the growth of a particularly powerful evil tree it will sprout soon south of the Wilderness Crater.",
    "special": true,
    "role_id": "1072267451674402837",
    "time_to_next_event": 1,
    "name": "Evil Bloodwood Tree",
    "id": "evil bloodwood tree",
    "time_hh": 13,
    "time_mm": 0,
    "next_event": "spider swarm",
    "desc": "Wilderness Flash Events: Evil Bloodwood Tree has started south of the Wilderness Crater!"
  }
]